from string import Template

### Query Expansion ###

# System prompt
query_expand_system_prompt = Template("\n".join([
    "أنت خبير في البحث الدلالي وتحسين الاستعلامات.",
    "مهمتك هي توسيع وتحسين الاستعلام المقدم ليصبح أكثر تفصيلًا وشمولية.",
    "قم بتضمين المرادفات والمصطلحات ذات الصلة لتحسين نتائج البحث.",
    "أعد فقط الاستعلام الموسع بدون أي شروحات إضافية."
]))

# User prompt
query_expand_user_prompt = Template("\n".join([
    "## الاستعلام الأصلي:",
    "$query",
    "",
    "## الاستعلام الموسع (سؤال واحد فقط):"
]))

#### RAG PROMPTS ####

#### System ####

system_prompt = Template("\n".join([
    "أنت مساعد لتوليد رد للمستخدم.",
    "ستحصل على مجموعة من المستندات المرتبطة باستفسار المستخدم.",
    "عليك توليد رد بناءً على المستندات المقدمة.",
    "تجاهل المستندات التي لا تتعلق باستفسار المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد رد.",
    "عليك توليد الرد بنفس لغة استفسار المستخدم.",
    "كن مؤدباً ومحترماً في التعامل مع المستخدم.",
    "كن دقيقًا ومختصرًا في ردك. تجنب المعلومات غير الضرورية.",
]))

#### Document ####
document_prompt = Template(
    "\n".join([
        "## المستند رقم: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)

#### Footer ####
footer_prompt = Template("\n".join([
    "بناءً فقط على المستندات المذكورة أعلاه، يرجى توليد إجابة للمستخدم.",
    "## السؤال:",
    "$query",
    "",
    "## الإجابة:",
]))
